INSERT INTO discipline (name, abbreviation) VALUES
('Алгоритмы и структуры данных', 'АиСД'),
('Конструирование программного обеспечения', 'КПО'),
('Операционные системы', 'ОС'),
('Компьютерные системы и сети', 'КСиС'),
('Объектно-ориентированные технологии программирования и стандарты проектирования', 'ООТПиСП'),
('Разработка клиентских веб-приложений', 'РКВП'),
('Веб-технологии', 'ВТ'),
('Специализированные языки разметки документов', 'СЯРД'),
('Теория информации', 'ТИ'),
('Системное программирование', 'СП'),
('Разработка и анализ требований', 'РиАТ'),
('Базы данных', 'БД'),
('Надежность программного обеспечения', 'НПО'),
('Проектирование интернет-систем', 'ПИС'),
('Разработка программного обеспечения для мобильных платформ', 'РПОмП'),
('Современные платформы программирования', 'СПП'),
('Программное обеспечение мобильной робототехникой', 'ПОМР'),
('Безопасность компьютерных систем и сетей', 'БКСиС'),
('Методы обработки данных', 'МОД'),
('Компьютерное моделирование и анализ данных', 'КМиАД'),
('Распределенные системы и облачные технологии', 'РСиОТ');

INSERT INTO specialty (code, name, abbreviation) VALUES
('1-40 03 01', 'Искусственный интеллект', 'ИИ'),
('1-53 01 02', 'Автоматизированные системы обработки информации', 'АСОИ'),
('1-40 01 01', 'Программное обеспечение информационных технологий', 'ПОИТ')
